GroggyAlgorithm/HalBuilder/Examples/GeneratedHeaders/atmega1284Pins.h
/**
* \file atmega1284Pins
* \author Auto Hal Builder, Tim Robbins
* \date 2023-09-26 12:38:01.198869
* \brief Auto Generated Definitions 
*
*/
#ifndef ATMEGA1284PINS_H_
#define ATMEGA1284PINS_H_ 1




#define PB0_PIN                         B, 0
#define PIN_0                           B, 0
#define INT8_PIN                        B, 0
#define XCK0_PIN                        B, 0
#define T0_PIN                          B, 0

#define PB1_PIN                         B, 1
#define PIN_1                           B, 1
#define INT9_PIN                        B, 1
#define CLKO_PIN                        B, 1
#define T1_PIN                          B, 1

#define PB2_PIN                         B, 2
#define PIN_2                           B, 2
#define INT10_PIN                       B, 2
#define INT2_PIN                        B, 2
#define AIN0_PIN                        B, 2

#define PWM_0A                          OCR0A
#define PB3_PERIPHERAL_0                OCR0A
#define PWM_0A_PIN                      B, 3
#define PB3_PIN                         B, 3
#define PIN_3                           B, 3
#define INT11_PIN                       B, 3
#define OC0A_PIN                        B, 3
#define AIN1_PIN                        B, 3

#define PWM_0B                          OCR0B
#define PB4_PERIPHERAL_0                OCR0B
#define PWM_0B_PIN                      B, 4
#define PB4_PIN                         B, 4
#define PIN_4                           B, 4
#define INT12_PIN                       B, 4
#define OC0B_PIN                        B, 4
#define SS_PIN                          B, 4

#define PB5_PIN                         B, 5
#define PIN_5                           B, 5
#define INT13_PIN                       B, 5
#define ICP3_PIN                        B, 5
#define MOSI_PIN                        B, 5

#define PWM_3A                          OCR3A
#define PB6_PERIPHERAL_0                OCR3A
#define PWM_3A_PIN                      B, 6
#define PB6_PIN                         B, 6
#define PIN_6                           B, 6
#define INT14_PIN                       B, 6
#define OC3A_PIN                        B, 6
#define MISO_PIN                        B, 6

#define PWM_3B                          OCR3B
#define PB7_PERIPHERAL_0                OCR3B
#define PWM_3B_PIN                      B, 7
#define PB7_PIN                         B, 7
#define PIN_7                           B, 7
#define INT15_PIN                       B, 7
#define OC3B_PIN                        B, 7
#define SCK_PIN                         B, 7

#define PD0_PIN                         D, 0
#define PIN_8                           D, 0
#define INT24_PIN                       D, 0
#define RXD0_PIN                        D, 0
#define T3_PIN                          D, 0

#define PD1_PIN                         D, 1
#define PIN_9                           D, 1
#define INT25_PIN                       D, 1
#define TXD0_PIN                        D, 1

#define PD2_PIN                         D, 2
#define PIN_10                          D, 2
#define INT26_PIN                       D, 2
#define RXD1_PIN                        D, 2
#define INT0_PIN                        D, 2

#define PD3_PIN                         D, 3
#define PIN_11                          D, 3
#define INT27_PIN                       D, 3
#define TXD1_PIN                        D, 3
#define INT1_PIN                        D, 3

#define PWM_1B                          OCR1B
#define PD4_PERIPHERAL_0                OCR1B
#define PWM_1B_PIN                      D, 4
#define PD4_PIN                         D, 4
#define PIN_12                          D, 4
#define INT28_PIN                       D, 4
#define XCK1_PIN                        D, 4
#define OC1B_PIN                        D, 4

#define PWM_1A                          OCR1A
#define PD5_PERIPHERAL_0                OCR1A
#define PWM_1A_PIN                      D, 5
#define PD5_PIN                         D, 5
#define PIN_13                          D, 5
#define INT29_PIN                       D, 5
#define OC1A_PIN                        D, 5

#define PWM_2B                          OCR2B
#define PD6_PERIPHERAL_0                OCR2B
#define PWM_2B_PIN                      D, 6
#define PD6_PIN                         D, 6
#define PIN_14                          D, 6
#define INT30_PIN                       D, 6
#define OC2B_PIN                        D, 6
#define ICP_PIN                         D, 6

#define ADC0_CHANNEL                    0
#define PA0_PERIPHERAL_0                0
#define ADC0_CHANNEL_PIN                A, 0
#define PA0_PIN                         A, 0
#define PIN_15                          A, 0
#define ADC0_PIN                        A, 0
#define INT0_PIN                        A, 0

#define ADC1_CHANNEL                    1
#define PA1_PERIPHERAL_0                1
#define ADC1_CHANNEL_PIN                A, 1
#define PA1_PIN                         A, 1
#define PIN_16                          A, 1
#define ADC1_PIN                        A, 1
#define INT1_PIN                        A, 1

#define ADC2_CHANNEL                    2
#define PA2_PERIPHERAL_0                2
#define ADC2_CHANNEL_PIN                A, 2
#define PA2_PIN                         A, 2
#define PIN_17                          A, 2
#define ADC2_PIN                        A, 2
#define INT2_PIN                        A, 2

#define ADC3_CHANNEL                    3
#define PA3_PERIPHERAL_0                3
#define ADC3_CHANNEL_PIN                A, 3
#define PA3_PIN                         A, 3
#define PIN_18                          A, 3
#define ADC3_PIN                        A, 3
#define INT3_PIN                        A, 3

#define ADC4_CHANNEL                    4
#define PA4_PERIPHERAL_0                4
#define ADC4_CHANNEL_PIN                A, 4
#define PA4_PIN                         A, 4
#define PIN_19                          A, 4
#define ADC4_PIN                        A, 4
#define INT4_PIN                        A, 4

#define ADC5_CHANNEL                    5
#define PA5_PERIPHERAL_0                5
#define ADC5_CHANNEL_PIN                A, 5
#define PA5_PIN                         A, 5
#define PIN_20                          A, 5
#define ADC5_PIN                        A, 5
#define INT5_PIN                        A, 5

#define ADC6_CHANNEL                    6
#define PA6_PERIPHERAL_0                6
#define ADC6_CHANNEL_PIN                A, 6
#define PA6_PIN                         A, 6
#define PIN_21                          A, 6
#define ADC6_PIN                        A, 6
#define INT6_PIN                        A, 6

#define ADC7_CHANNEL                    7
#define PA7_PERIPHERAL_0                7
#define ADC7_CHANNEL_PIN                A, 7
#define PA7_PIN                         A, 7
#define PIN_22                          A, 7
#define ADC7_PIN                        A, 7
#define INT7_PIN                        A, 7

#define PC7_PIN                         C, 7
#define PIN_23                          C, 7
#define TOSC2_PIN                       C, 7
#define INT23_PIN                       C, 7

#define PC6_PIN                         C, 6
#define PIN_24                          C, 6
#define TOSC1_PIN                       C, 6
#define INT22_PIN                       C, 6

#define PC5_PIN                         C, 5
#define PIN_25                          C, 5
#define TDI_PIN                         C, 5
#define INT21_PIN                       C, 5

#define PC4_PIN                         C, 4
#define PIN_26                          C, 4
#define TDO_PIN                         C, 4
#define INT20_PIN                       C, 4

#define PC3_PIN                         C, 3
#define PIN_27                          C, 3
#define TMS_PIN                         C, 3
#define INT19_PIN                       C, 3

#define PC2_PIN                         C, 2
#define PIN_28                          C, 2
#define TCK_PIN                         C, 2
#define INT18_PIN                       C, 2

#define PC1_PIN                         C, 1
#define PIN_29                          C, 1
#define SDA_PIN                         C, 1
#define INT17_PIN                       C, 1

#define PC0_PIN                         C, 0
#define PIN_30                          C, 0
#define SCL_PIN                         C, 0
#define INT16_PIN                       C, 0

#define PWM_2A                          OCR2A
#define PD7_PERIPHERAL_0                OCR2A
#define PWM_2A_PIN                      D, 7
#define PD7_PIN                         D, 7
#define PIN_31                          D, 7
#define OC2A_PIN                        D, 7
#define INT31_PIN                       D, 7



//Adc Definitions


//Pwm Definitions



#endif
